# 🚀 Разбор задачи: Встреча Бегимай, Айдара и Виктора

### 💡 Идея решения
Поскольку ограничения в задаче небольшие, мы можем эффективно смоделировать процесс с помощью цикла `while`. 

Логика зависит от начального направления движения Бегимай:
* **Если направление чтения Бегимай равно `L`**:
  Мы эмулируем её встречу с Айдаром, а ответ для Виктора рассчитываем по формуле: `n - be`.
* **Если направление чтения Бегимай равно `R`**:
  Мы сначала эмулируем её встречу с Виктором, а ответ для Айдара будет равен: `be - 1`.

> **📌 Постскриптум:** `be` — точка, в которой стартовала Бегимай.

---

### 💻 Код решения (C++)

```cpp
#include <bits/stdc++.h>
/*
 author: The Pinnacle
*/
 
using namespace std;
using ll = long long;
using ld = long double; 

void solve() {
    int n, s; cin >> n >> s; 
    char c; cin >> c;
    
    int ai = 1;
    int vi = n;
    int be = s; 
    
    vector<int> a(3);
    
    if (c == 'L') {
        while (s >= ai) {
            a[2]++; a[0]++;
            ai++;
            s--;
        }
        a[1] = vi - be;
    } else {
        while (s <= vi) {
            a[2]++; a[1]++;
            vi--;
            s++;
        }
        a[0] = be - 1;
    }
    
    cout << a[0] << ' ';
    cout << a[2] << ' ';
    cout << a[1] << ' ';
}

int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);
    solve();
    
    return 0;
}
```
